# AllLocalChangesSavedToCentral Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicFileInfo..::..AllLocalChangesSavedToCentral Property
BasicFileInfo Class See Also
---
Are all local changes saved to the central file?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool AllLocalChangesSavedToCentral { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllLocalChangesSavedToCentral As Boolean
	Get
```

Visual C++
---
```text
public:
property bool AllLocalChangesSavedToCentral {
	bool get ();
}
```

# See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace